---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemEndtreatmentEnd
source: html/834cddab-f41a-606d-b96d-174910a65d68.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemEndtreatmentEnd Property

"End Treatment At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemEndtreatmentEnd { get; }
```